* Dropping Columns
* Dropping Rows
* Various Parameter in Dropping Functionalities
* Handling Missing Values by Mean, Median and Mode

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName('app3').getOrCreate()

In [6]:
df_spark = spark.read.csv('test2.csv', header=True, inferSchema=True)

In [7]:
df_spark.show()

+---------+----+----------+------+
|     Name| age|experience|salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|    Ankit|  45|         3| 15000|
|    Anand|  32|         2| 20000|
| Karishma|  24|         5| 18000|
|   Suresh|null|      null| 40000|
|     null|  45|        10| 38000|
|     null|  37|      null|  null|
+---------+----+----------+------+

In [8]:
## drop the column; Note: Not a inplace operation
df_spark.drop('Name').show()

+----+----------+------+
| age|experience|salary|
+----+----------+------+
|  31|        10| 30000|
|  30|         8| 25000|
|  29|         4| 20000|
|  45|         3| 15000|
|  32|         2| 20000|
|  24|         5| 18000|
|null|      null| 40000|
|  45|        10| 38000|
|  37|      null|  null|
+----+----------+------+

In [10]:
## drop rows
df_spark.na.drop().show()  # drop all rows having any null values

+---------+---+----------+------+
|     Name|age|experience|salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|    Ankit| 45|         3| 15000|
|    Anand| 32|         2| 20000|
| Karishma| 24|         5| 18000|
+---------+---+----------+------+

In [11]:
## how==all; drop only if all values in a row are null
df_spark.na.drop(how='all').show()

+---------+----+----------+------+
|     Name| age|experience|salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|    Ankit|  45|         3| 15000|
|    Anand|  32|         2| 20000|
| Karishma|  24|         5| 18000|
|   Suresh|null|      null| 40000|
|     null|  45|        10| 38000|
|     null|  37|      null|  null|
+---------+----+----------+------+

In [16]:
## threshold
df_spark.na.drop(thresh=2).show()  # Should have atleat 2 non null values

+---------+----+----------+------+
|     Name| age|experience|salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|    Ankit|  45|         3| 15000|
|    Anand|  32|         2| 20000|
| Karishma|  24|         5| 18000|
|   Suresh|null|      null| 40000|
|     null|  45|        10| 38000|
+---------+----+----------+------+

In [17]:
## threshold
df_spark.na.drop(thresh=3).show()  # Should have atleat 3 non null values

+---------+---+----------+------+
|     Name|age|experience|salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|    Ankit| 45|         3| 15000|
|    Anand| 32|         2| 20000|
| Karishma| 24|         5| 18000|
|     null| 45|        10| 38000|
+---------+---+----------+------+

In [18]:
## subset: Remove the rows that have null values in the specified column
df_spark.na.drop(subset=['salary']).show()

+---------+----+----------+------+
|     Name| age|experience|salary|
+---------+----+----------+------+
|    Krish|  31|        10| 30000|
|Sudhanshu|  30|         8| 25000|
|    Sunny|  29|         4| 20000|
|    Ankit|  45|         3| 15000|
|    Anand|  32|         2| 20000|
| Karishma|  24|         5| 18000|
|   Suresh|null|      null| 40000|
|     null|  45|        10| 38000|
+---------+----+----------+------+

In [19]:
df_spark.na.drop(subset=['experience']).show()

+---------+---+----------+------+
|     Name|age|experience|salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|    Ankit| 45|         3| 15000|
|    Anand| 32|         2| 20000|
| Karishma| 24|         5| 18000|
|     null| 45|        10| 38000|
+---------+---+----------+------+

In [31]:
## Filling the missing values
df_spark.na.fill(0).show()  # Only replace integer values

+---------+---+----------+------+
|     Name|age|experience|salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sudhanshu| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|    Ankit| 45|         3| 15000|
|    Anand| 32|         2| 20000|
| Karishma| 24|         5| 18000|
|   Suresh|  0|         0| 40000|
|     null| 45|        10| 38000|
|     null| 37|         0|     0|
+---------+---+----------+------+

In [32]:
df_spark.na.fill('Missing Values').show()  # only fills missing string columns

+--------------+----+----------+------+
|          Name| age|experience|salary|
+--------------+----+----------+------+
|         Krish|  31|        10| 30000|
|     Sudhanshu|  30|         8| 25000|
|         Sunny|  29|         4| 20000|
|         Ankit|  45|         3| 15000|
|         Anand|  32|         2| 20000|
|      Karishma|  24|         5| 18000|
|        Suresh|null|      null| 40000|
|Missing Values|  45|        10| 38000|
|Missing Values|  37|      null|  null|
+--------------+----+----------+------+

In [34]:
from pyspark.ml.feature import Imputer

In [39]:
imputer = Imputer(
inputCols = ['age', 'experience'],
outputCols = [f"{c}_imputed" for c in ['age', 'experience']]
).setStrategy("mean")

In [40]:
# Add imputed columns to df
imputer.fit(df_spark).transform(df_spark).show()

+---------+----+----------+------+-----------+------------------+
|     Name| age|experience|salary|age_imputed|experience_imputed|
+---------+----+----------+------+-----------+------------------+
|    Krish|  31|        10| 30000|         31|                10|
|Sudhanshu|  30|         8| 25000|         30|                 8|
|    Sunny|  29|         4| 20000|         29|                 4|
|    Ankit|  45|         3| 15000|         45|                 3|
|    Anand|  32|         2| 20000|         32|                 2|
| Karishma|  24|         5| 18000|         24|                 5|
|   Suresh|null|      null| 40000|         34|                 6|
|     null|  45|        10| 38000|         45|                10|
|     null|  37|      null|  null|         37|                 6|
+---------+----+----------+------+-----------+------------------+